In [2]:
import numpy as np
import pandas as pd

In [3]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [4]:
df.dropna() #Drop Rows if any row has NaN values

     A    B  C
0  1.0  5.0  1

In [5]:
df # doesn't drop because inplace is false by default

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [6]:
df.dropna(axis=1) # Drop Columns if any column has NaN values

   C
0  1
1  2
2  3

In [7]:
df.dropna(axis=0, thresh=2) #thresh=2 means row should have atleast 2 non-NaN values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [8]:
df.fillna(value='Fill Value') #Fill NaN values with 'Fill Value' Object

            A           B  C
0           1           5  1
1           2  Fill Value  2
2  Fill Value  Fill Value  3

In [9]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [10]:
df['A'].fillna(value=df['A'].mean()) #Fill the missing values with the mean of that column

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64